tap "fujiwara/tap"
tap "homebrew/bundle"
tap "songmu/tap"
brew "amazon-ecs-cli"
brew "coreutils"
brew "asdf"
brew "awscli"
brew "curl"
brew "direnv"
brew "fish"
brew "fzf"
brew "ghq"
brew "git"
brew "git-lfs"
brew "jq"
brew "mas"
brew "mysql"
brew "peco"
brew "shellcheck"
brew "tfenv"
brew "tflint"
brew "tree"
brew "yarn"
brew "zoxide"
brew "fujiwara/tap/ecsta"
brew "songmu/tap/ecschedule"
cask "1password-cli"
cask "amethyst"
cask "bettertouchtool"
cask "clipy"
cask "dbeaver-community"
cask "docker"
cask "google-chrome"
cask "karabiner-elements"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "slack"
cask "visual-studio-code"
cask "warp"
mas "Pages", id: 409201541
mas "SafeInCloud 2", id: 883070818
mas "Skitch", id: 425955336
vscode "alefragnani.Bookmarks"
vscode "bung87.vscode-gemfile"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "EdgardMessias.clipboard-manager"
vscode "esbenp.prettier-vscode"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "Hridoy.rails-snippets"
vscode "James-Yu.latex-workshop"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.LiveServer"
vscode "ryu1kn.partial-diff"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "Vue.volar"
vscode "waderyan.gitblame"
vscode "wmaurer.change-case"
vscode "zxh404.vscode-proto3"
