tap "homebrew/bundle"
brew "asdf"
brew "awscli"
brew "direnv"
brew "fish"
brew "fzf"
brew "ghq"
brew "jq"
brew "mas"
brew "mysql"
brew "peco"
brew "shellcheck"
brew "tree"
cask "amethyst"
cask "bettertouchtool"
cask "clipy"
cask "dbeaver-community"
cask "docker"
cask "google-chrome"
cask "karabiner-elements"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "slack"
cask "visual-studio-code"
cask "warp"
mas "SafeInCloud 2", id: 883070818
vscode "Arjun.swagger-viewer"
vscode "christian-kohler.path-intellisense"
vscode "EdgardMessias.clipboard-manager"
vscode "esbenp.prettier-vscode"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "James-Yu.latex-workshop"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "ryu1kn.partial-diff"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "wmaurer.change-case"
vscode "zxh404.vscode-proto3"
